jojo240607/joc-base/src/hal/stm32/test/rtos_accept.c
/* =================== A3. 调度抖动(jitter) =================== */
static volatile uint32_t g_a3_t0, g_a3_max, g_a3_min, g_a3_sum, g_a3_n;
static rtos_sem_t         g_a3_s0, g_a3_s1;
RTOS_TASK_STACK(g_a3_a, 512); RTOS_TASK_STACK(g_a3_b, 512);
static void a3_a(void *arg) {
    (void)arg;
    int primed = 0;
    while (g_a3_n < 500) {
        uint32_t t = rtos_cycle_now();
        uint32_t lat = (t > g_a3_t0) ? (t - g_a3_t0) : 0;
        /* 首轮 g_a3_t0 尚未被 b 写入（=0），lat 为伪值，必须跳过统计 */
        if (primed) {
            g_a3_sum += lat;
            if (lat > g_a3_max) g_a3_max = lat;
            if (g_a3_min == 0 || lat < g_a3_min) g_a3_min = lat;
            g_a3_n++;
        }
        primed = 1;
        rtos_sem_give(&g_a3_s1);
        rtos_sem_wait(&g_a3_s0);
    }
}
static void a3_b(void *arg) {
    (void)arg;
    rtos_sem_wait(&g_a3_s1);
    while (g_a3_n < 500) {
        g_a3_t0 = rtos_cycle_now();
        rtos_sem_give(&g_a3_s0);
        rtos_sem_wait(&g_a3_s1);
    }
}
int acc_a3_jitter(void) {
    int ok = 1;
    rtos_cycle_init();
    rtos_sem_init(&g_a3_s0, 0, 2);
    rtos_sem_init(&g_a3_s1, 0, 2);
    g_a3_t0 = g_a3_max = g_a3_sum = g_a3_n = 0; g_a3_min = 0;
    rtos_task_create("acc_ja", a3_a, NULL, 10, g_a3_a, sizeof(g_a3_a));
    rtos_task_create("acc_jb", a3_b, NULL, 10, g_a3_b, sizeof(g_a3_b));
    if (!rtos_kobj_lookup("acc_ja")) {
        log_printf(app_log(), LOG_INFO, "rtos", "[ACC-A3] SKIP: pool full\n");
        RTOS_TEST_RESULT("ACC_A3_Jitter", 0);
        return 1;
    }
    uint32_t to = rtos_tick_count() + 300;
    while (g_a3_n < 500 && rtos_tick_count() < to) rtos_msleep(2);
    uint32_t avg = (g_a3_n > 0) ? (g_a3_sum / g_a3_n) : 0;
    uint32_t jitter = (g_a3_max > g_a3_min) ? (g_a3_max - g_a3_min) : 0;
    /* 同优先级上下文切换抖动预算：非插桩构建 <3000cyc（硬实时确定性断言）；
     * 覆盖率构建(-DCOVERAGE=ON)下 gcov 插桩放大切换路径，jitter 已知达 ~3278cyc，
     * 放宽到 6000cyc 仅用于覆盖率采集运行（不苛求硬实时断言）。 */
    #ifndef RTOS_COVERAGE
    #  define ACC_A3_JITTER_BUDGET 3000u
    #else
    #  define ACC_A3_JITTER_BUDGET 6000u
    #endif
    int lok = (g_a3_n >= 500) && (jitter < ACC_A3_JITTER_BUDGET) && (g_stack_overflow == 0);
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[JITTER] ctx_switch n=%lu min=%lu avg=%lu max=%lu jitter=%lu (budget<%lucyc%s) %s\n",
               (unsigned long)g_a3_n, (unsigned long)g_a3_min, (unsigned long)avg,
               (unsigned long)g_a3_max, (unsigned long)jitter,
               (unsigned long)ACC_A3_JITTER_BUDGET,
               #ifdef RTOS_COVERAGE
               " cov-relaxed",
               #else
               "",
               #endif
               lok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A3_Jitter", lok);
    /* 清理：a/b 在 n>=500 后阻塞于 sem，delete 摘链置 DEAD */
    task_t *ja = (task_t *)rtos_kobj_lookup("acc_ja");
    task_t *jb = (task_t *)rtos_kobj_lookup("acc_jb");
    if (ja) rtos_task_delete(ja);
    if (jb) rtos_task_delete(jb);
    rtos_msleep(20);
    return ok;
}

/* =================== A4. RTA 正确性自测（验证 rtos_wcrt_compute 本身） =================== */
int acc_a4_rta(void) {
    int ok = 1;
    static const uint32_t C1[3] = {1,1,2}, T1[3] = {4,6,12};
    static const uint8_t  P1[3] = {0,1,2};
    static uint32_t W1[3];
    int r1 = rtos_wcrt_compute(C1, T1, P1, 3, W1);
    int lok1 = (r1 == 0) && (W1[0] <= T1[0]) && (W1[1] <= T1[1]) && (W1[2] <= T1[2]);
    if (!lok1) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-A4] feasible: rta=%d wcrt=%lu/%lu/%lu (T=4/6/12) %s\n",
               r1, (unsigned long)W1[0], (unsigned long)W1[1], (unsigned long)W1[2], lok1 ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A4_RTA_Feasible", lok1);

    static const uint32_t C2[2] = {3,3}, T2[2] = {4,5};
    static const uint8_t  P2[2] = {0,1};
    static uint32_t W2[2];
    int r2 = rtos_wcrt_compute(C2, T2, P2, 2, W2);
    int lok2 = (r2 > 0);
    if (!lok2) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos", "[ACC-A4] infeasible: rta=%d (expect >0) %s\n", r2, lok2 ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A4_RTA_Infeasible", lok2);

    static const uint32_t C3[1] = {5}, T3[1] = {5};
    static const uint8_t  P3[1] = {0};
    static uint32_t W3[1];
    int r3 = rtos_wcrt_compute(C3, T3, P3, 1, W3);
    int lok3 = (r3 == 0) && (W3[0] == 5u);
    if (!lok3) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos", "[ACC-A4] boundary: rta=%d wcrt=%lu (T=5) %s\n", r3, (unsigned long)W3[0], lok3 ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A4_RTA_Boundary", lok3);
    return ok;
}

/* =================== A5. 动态可调度性再验证（P1-3） =================== */
/* 验证「运行时动态增删硬实时任务后，rtos_sched_validate() 能正确反映新任务集」的闭环：
 *  1) 动态增一组「可调度」硬实时任务 -> validate 不应报违约（== 基线）；
 *  2) 动态删这组任务 -> validate 仍不应报违约（无残留误报）；
 *  3) 用 rtos_wcrt_compute 纯函数构造已知过载反例 -> 断言能抓出 infeasible（运行时
 *     上下文 RTA 仍有效）。
 * 动态创建的硬实时任务短暂存在即删除，避免长期占用高优先级带影响系统稳定性。 */
static volatile int g_a5_stop;
static void a5_rt(void *arg) {
    (void)arg;
    while (!g_a5_stop) { acc_spin_ms(0); rtos_msleep(8); }
}
int acc_a5_dyn_sched(void) {
    int ok = 1;
    uint32_t inv0 = g_rtos_sched_invalid;
    g_a5_stop = 0;

    /* 1) 动态增：2 个可调度硬实时任务（C=2,T=20,prio 2/3，单/互干扰 WCRT<=20） */
    static uint8_t a5s0[256] __attribute__((aligned(8)));
    static uint8_t a5s1[256] __attribute__((aligned(8)));
    rtos_task_attr_t a5at = { .rt_class = 1, .deadline_ticks = 20, .wcet_ticks = 2 };
    rtos_task_create_rt("acc_a5rt0", a5_rt, NULL, 2, a5s0, sizeof(a5s0), 1, &a5at);
    rtos_task_create_rt("acc_a5rt1", a5_rt, NULL, 3, a5s1, sizeof(a5s1), 1, &a5at);
    rtos_msleep(20);  /* 让其短暂运行，确认真实占用高优带不破坏系统 */
    int inf_add = rtos_sched_validate();
    int lok_add = (inf_add == 0) && (g_rtos_sched_invalid == inv0);
    if (!lok_add) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-A5] after add 2 feasible RT tasks: infeasible=%d (expect 0) %s\n",
               inf_add, lok_add ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A5_DynAdd", lok_add);

    /* 2) 动态删：移除这组任务后 validate 应回到基线（无残留误报） */
    task_t *p0 = (task_t *)rtos_kobj_lookup("acc_a5rt0");
    task_t *p1 = (task_t *)rtos_kobj_lookup("acc_a5rt1");
    g_a5_stop = 1;
    if (p0) rtos_task_delete(p0);
    if (p1) rtos_task_delete(p1);
    rtos_msleep(30);
    int inf_del = rtos_sched_validate();
    int lok_del = (inf_del == 0) && (g_rtos_sched_invalid == inv0);
    if (!lok_del) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-A5] after delete RT tasks: infeasible=%d (expect 0) %s\n",
               inf_del, lok_del ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A5_DynDel", lok_del);

    /* 3) RTA 抓过载（纯函数，运行时不建真实过载任务，避免系统不稳定）：
     *    两任务 p0/p1, C=[15,15], T=[20,20] -> WCRT_1 = 15+ceil(W/20)*15 必超 20 -> infeasible。 */
    static const uint32_t Cx[2] = {15, 15}, Tx[2] = {20, 20};
    static const uint8_t  Px[2] = {0, 1};
    static uint32_t Wx[2];
    int inf_ov = rtos_wcrt_compute(Cx, Tx, Px, 2, Wx);
    int lok_ov = (inf_ov > 0);
    if (!lok_ov) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-A5] overload RTA: infeasible=%d wcrt=%lu/%lu (expect >0) %s\n",
               inf_ov, (unsigned long)Wx[0], (unsigned long)Wx[1], lok_ov ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_A5_OverloadRTA", lok_ov);

    g_rtos_sched_invalid = inv0;  /* 恢复基线，避免影响后续验收/RTOSALL 粘性标志 */
    return ok;
}

/* =================== A6. IPC 阻塞最坏事延迟验收（P2-3） ===================
 * 量化「高优硬实时任务阻塞在 rtos_mq_recv、被低优生产者 rtos_mq_send 唤醒」的
 * 端到端最坏延迟：send 唤醒 recv 等待者 -> schedule_request -> PendSV 切换 ->
 * 消费者运行 -> recv 返回。衡量内核 IPC 阻塞路径（含跨优先级抢占）的 WCET 确定性。
 *
 * 手法（复用 A1/A3 的 CYCCNT + 直方图惯例）：
 *   - 消费者 a6_hi (prio 3, 硬实时带) 阻塞于 rtos_mq_recv；
 *   - 生产者 a6_lo (prio 20, 背景带) 每条：g_a6_t0=rtos_cycle_now() -> rtos_mq_send；
 *   - 消费者 recv 返回后 lat = rtos_cycle_now() - g_a6_t0，落入直方图 g_a6_hist[]。
 * 断言：样本足额(>=ACC_A6_N) 且 worst < ACC_A6_BUDGET（非插桩 3000cyc / 插桩 6000cyc）；
 *       零延迟 ISR 不挡唤醒路径（CYCCNT 不受 BASEPRI 影响，latency 真实含抢占）。
 */
#define ACC_A6_N          500u
#define ACC_A6_BINS       64u
#define ACC_A6_BIN_CYC    50u    /* 桶宽 50cyc @168MHz（IPC 延迟亚微秒级，细桶区分分布） */
#define ACC_A6_MQ_CAP     8u
#ifndef RTOS_COVERAGE
#  define ACC_A6_BUDGET   3000u  /* 非插桩：上下文切换 + 唤醒确定性预算 */
#else
#  define ACC_A6_BUDGET   6000u  /* 覆盖率插桩放大切换路径，放宽 */
#endif
static volatile int       g_a6_stop;
static volatile uint32_t  g_a6_t0;
static volatile uint32_t  g_a6_max, g_a6_sum, g_a6_n;
static volatile uint32_t  g_a6_hist[ACC_A6_BINS];
static rtos_mq_t          g_a6_mq;
static uint8_t            g_a6_mqbuf[ACC_A6_MQ_CAP * sizeof(uint32_t)];
RTOS_TASK_STACK(g_a6_hi_stk, 512);
RTOS_TASK_STACK(g_a6_lo_stk, 512);

