jojo240607/joc-base/src/hal/stm32/test/rtos_accept.c
static void a6_hi(void *arg) {
    (void)arg;
    uint32_t v = 0;
    while (!g_a6_stop) {
        rtos_mq_recv(&g_a6_mq, &v);            /* 阻塞：被 send 唤醒后抢占 lo */
        uint32_t now = rtos_cycle_now();
        uint32_t lat = (now > g_a6_t0) ? (now - g_a6_t0) : 0;
        g_a6_sum += lat;
        if (lat > g_a6_max) g_a6_max = lat;
        g_a6_n++;
        unsigned bin = (unsigned)((lat + ACC_A6_BIN_CYC - 1u) / ACC_A6_BIN_CYC);
        if (bin >= ACC_A6_BINS) bin = ACC_A6_BINS - 1u;
        g_a6_hist[bin]++;
    }
}
static void a6_lo(void *arg) {
    (void)arg;
    uint32_t v = 0;
    while (!g_a6_stop) {
        g_a6_t0 = rtos_cycle_now();            /* 生产者打戳：send 前 */
        rtos_mq_send(&g_a6_mq, &v);            /* 唤醒阻塞的 hi（recv 等待者） */
        v++;
        acc_spin_ms(0);                        /* 背景负载，制造切换窗口 */
        rtos_msleep(1);                        /* 让出，保证 hi 能抢占回来 */
    }
}
int acc_a6_ipc_worst(void) {
    int ok = 1;
    rtos_cycle_init();
    g_a6_stop = 0; g_a6_max = g_a6_sum = g_a6_n = 0;
    for (unsigned b = 0; b < ACC_A6_BINS; b++) g_a6_hist[b] = 0;
    rtos_mq_init(&g_a6_mq, g_a6_mqbuf, sizeof(uint32_t), ACC_A6_MQ_CAP);

    /* 先起消费者使其阻塞于 recv，再起生产者制造唤醒 */
    rtos_task_create("acc_a6hi", a6_hi, NULL, 3, g_a6_hi_stk, sizeof(g_a6_hi_stk));
    rtos_task_create("acc_a6lo", a6_lo, NULL, 20, g_a6_lo_stk, sizeof(g_a6_lo_stk));
    if (!rtos_kobj_lookup("acc_a6hi")) {
        log_printf(app_log(), LOG_INFO, "rtos", "[ACC-A6] SKIP: pool full\n");
        RTOS_TEST_RESULT("ACC_A6_IPCWorst", 0);
        return 1;
    }
    uint32_t to = rtos_tick_count() + ACC_A6_N + 200;  /* 采样窗口须 > ACC_A6_N（lo 每 tick 1 样本） */
    while (g_a6_n < ACC_A6_N && rtos_tick_count() < to) rtos_msleep(2);

    uint32_t avg = (g_a6_n > 0) ? (g_a6_sum / g_a6_n) : 0;
    int lok = (g_a6_n >= ACC_A6_N) && (g_a6_max < ACC_A6_BUDGET) && (g_stack_overflow == 0);
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[IPC-WORST] mq_recv wake n=%lu min~avg=%lu max=%lu (budget<%lucyc%s) %s\n",
               (unsigned long)g_a6_n, (unsigned long)avg, (unsigned long)g_a6_max,
               (unsigned long)ACC_A6_BUDGET,
               #ifdef RTOS_COVERAGE
               " cov-relaxed",
               #else
               "",
               #endif
               lok ? "PASS" : "FAIL");
    /* 直方图（细桶，前若干非空桶） */
    uint32_t cum = 0, p99_cyc = 0;
    for (unsigned b = 0; b < ACC_A6_BINS; b++) {
        cum += g_a6_hist[b];
        if (g_a6_hist[b]) {
            log_printf(app_log(), LOG_INFO, "rtos",
                       "  [IPC-HIST] bin[%2u] %4lu-%4lucyc: %lu\n", b,
                       (unsigned long)(b * ACC_A6_BIN_CYC),
                       (unsigned long)((b + 1) * ACC_A6_BIN_CYC),
                       (unsigned long)g_a6_hist[b]);
        }
        if (!p99_cyc && cum >= (g_a6_n * 99u / 100u)) p99_cyc = (b + 1) * ACC_A6_BIN_CYC;
    }
    log_printf(app_log(), LOG_INFO, "rtos", "  [IPC-HIST] p99<=%lucyc\n", (unsigned long)p99_cyc);
    RTOS_TEST_RESULT("ACC_A6_IPCWorst", lok);

    /* 清理：置 stop 后两任务阻塞于 msleep/recv，delete 摘链置 DEAD */
    g_a6_stop = 1;
    task_t *hi = (task_t *)rtos_kobj_lookup("acc_a6hi");
    task_t *lo = (task_t *)rtos_kobj_lookup("acc_a6lo");
    if (hi) rtos_task_delete(hi);
    if (lo) rtos_task_delete(lo);
    rtos_msleep(20);
    return ok;
}

/* =================== B1. 长时 soak =================== */
#define ACC_SOAK_MS 60000u        /* 默认 soak 时长；P1-4 起支持可配置（最长 1h） */
#define ACC_SOAK_LONG_MS 3600000u /* RTOSACCEPT long 专用的 1 小时 soak */
#define ACC_DL_SAMPLE_MS 60000u   /* P1-4：每 60s 周期采样 RTOSDEADLINE，校验无计数漂移 */
static volatile int       g_b1_stop;
static volatile uint32_t  g_b1_ops;
static volatile uint32_t  g_b1_hb;
static rtos_sem_t         g_b1_sem[3];
static rtos_mutex_t       g_b1_mtx;
static rtos_mq_t          g_b1_mq;
static uint8_t            g_b1_mqbuf[16 * sizeof(uint32_t)];
static uint32_t b1_rand(void) {
    static uint32_t s = 0x9E3779B9u;
    s = s * 1664525u + 1013904223u;
    return s;
}
static void b1_worker(void *arg) {
    (void)arg;
    while (!g_b1_stop) {
        uint32_t r = b1_rand() % 8;
        switch (r) {
            case 0: rtos_sem_trywait(&g_b1_sem[r % 3]); break;
            case 1: rtos_sem_give(&g_b1_sem[r % 3]); break;
            case 2: if (rtos_mutex_trylock(&g_b1_mtx) == 0) { acc_spin_ms(0); rtos_mutex_unlock(&g_b1_mtx); } break;
            case 3: { uint32_t v = b1_rand(); rtos_mq_trysend(&g_b1_mq, &v); } break;
            case 4: { uint32_t v = 0; rtos_mq_tryrecv(&g_b1_mq, &v); } break;
            case 5: rtos_msleep(1); break;
            case 6: rtos_yield(); break;
            default: rtos_msleep(1); break;
        }
        g_b1_ops++;
        if ((r & 0x1F) == 0) rtos_yield();
    }
}
static void b1_hb(void *arg) {
    (void)arg;
    while (!g_b1_stop) { g_b1_hb++; rtos_msleep(5); }
}
static void b1_rt(void *arg) {
    (void)arg;
    while (!g_b1_stop) { acc_spin_ms(0); rtos_msleep(8); }   /* 轻量硬实时，8ms 周期 */
}
int acc_b1_soak(uint32_t soak_ms) {
    int ok = 1;
    rtos_cycle_init();
    uint32_t inv0 = g_sched_invariant_fail;
    uint32_t vd0 = g_rtos_deadline_violation, vw0 = g_rtos_wcet_violation, vs0 = g_rtos_sched_invalid;
    uint32_t flt0 = g_fault_cfsr, of0 = g_stack_overflow;
    int count0 = rtos_task_count();
    /* P1-4：deadline/wcet 逐任务基线（soak 起点）；周期采样比较增量是否漂移 */
    uint32_t b1_dl_miss0 = 0, b1_wc_miss0 = 0;
    for (int i = 0; i < RTOS_MAX_TASKS; i++) {
        b1_dl_miss0 += rtos_task_deadline_miss(i);
        b1_wc_miss0 += rtos_task_wcet_miss(i);
    }
    for (int i = 0; i < 3; i++) rtos_sem_init(&g_b1_sem[i], 0, 100000);
    rtos_mutex_init(&g_b1_mtx, 14);
    rtos_mq_init(&g_b1_mq, g_b1_mqbuf, sizeof(uint32_t), 16);
    g_b1_stop = 0; g_b1_ops = 0; g_b1_hb = 0;
    static uint8_t b1rt[256] __attribute__((aligned(8)));
    rtos_task_attr_t at = { .rt_class = 1, .deadline_ticks = 10, .wcet_ticks = 2 };
    rtos_task_create_rt("acc_rt", b1_rt, NULL, 3, b1rt, sizeof(b1rt), 1, &at);
    static uint8_t b1w[4][256] __attribute__((aligned(8)));
    static const char *b1wn[4] = { "acc_sw0", "acc_sw1", "acc_sw2", "acc_sw3" };
    for (int i = 0; i < 4; i++)
        rtos_task_create(b1wn[i], b1_worker, NULL, (uint8_t)(12 + i), b1w[i], sizeof(b1w[i]));
    static uint8_t b1hb[256] __attribute__((aligned(8)));
    rtos_task_create("acc_hb", b1_hb, NULL, 7, b1hb, sizeof(b1hb));
    if (!rtos_kobj_lookup("acc_hb")) {
        log_printf(app_log(), LOG_INFO, "rtos", "[ACC-B1] SKIP: pool full\n");
        RTOS_TEST_RESULT("ACC_B1_Soak", 0);
        return 1;
    }
    uint32_t hb0 = g_b1_hb, ops0 = g_b1_ops, tk0 = rtos_tick_count();
    uint32_t elapsed = 0, dl_sample_acc = 0;
    while (elapsed < soak_ms) {
        rtos_msleep(5000);
        elapsed += 5000;
        dl_sample_acc += 5000;
        if (g_sched_invariant_fail != inv0 || g_fault_cfsr != flt0 || g_stack_overflow != of0
            || g_rtos_deadline_violation != vd0 || g_rtos_wcet_violation != vw0
            || g_rtos_sched_invalid != vs0) {
            ok = 0;
            log_printf(app_log(), LOG_INFO, "rtos",
                       "[ACC-B1] MID-FAIL at %lums: inv=%lu flt=%lu of=%d vd=%lu vw=%lu vs=%lu\n",
                       (unsigned long)elapsed,
                       (unsigned long)(g_sched_invariant_fail - inv0),
                       (unsigned long)(g_fault_cfsr - flt0), (int)(g_stack_overflow - of0),
                       (unsigned long)(g_rtos_deadline_violation - vd0),
                       (unsigned long)(g_rtos_wcet_violation - vw0),
                       (unsigned long)(g_rtos_sched_invalid - vs0));
            break;
        }
        /* P1-4：每 ACC_DL_SAMPLE_MS 周期采样 RTOSDEADLINE 逐任务违约计数，
         * 断言无新增（无计数漂移）。稳态下这些计数应保持 = 基线。 */
        if (dl_sample_acc >= ACC_DL_SAMPLE_MS) {
            dl_sample_acc = 0;
            uint32_t dl_miss = 0, wc_miss = 0;
            for (int i = 0; i < RTOS_MAX_TASKS; i++) {
                dl_miss += rtos_task_deadline_miss(i);
                wc_miss += rtos_task_wcet_miss(i);
            }
            if ((dl_miss != b1_dl_miss0) || (wc_miss != b1_wc_miss0)) {
                ok = 0;
                log_printf(app_log(), LOG_INFO, "rtos",
                           "[ACC-B1] DL-DRIFT at %lums: dl_miss %lu->%lu wc_miss %lu->%lu\n",
                           (unsigned long)elapsed,
                           (unsigned long)b1_dl_miss0, (unsigned long)dl_miss,
                           (unsigned long)b1_wc_miss0, (unsigned long)wc_miss);
            }
            log_printf(app_log(), LOG_INFO, "rtos",
                       "[B1-DL-SAMPLE] %lums dl_miss=%lu wc_miss=%lu vd=%lu vw=%lu\n",
                       (unsigned long)elapsed,
                       (unsigned long)dl_miss, (unsigned long)wc_miss,
                       (unsigned long)(g_rtos_deadline_violation - vd0),
                       (unsigned long)(g_rtos_wcet_violation - vw0));
        }
    }
    g_b1_stop = 1;
    rtos_msleep(100);
    uint32_t tk1 = rtos_tick_count(), hb1 = g_b1_hb, ops1 = g_b1_ops;
    /* 注意：rtos_task_count() 是“历史分配高水位”单调不减（任务退出变 DEAD 槽被复用，
     * 计数不降）；本 soak 创建的 rt/w/hb 任务在 g_b1_stop 后置 BLOCKED 仍存活，故
     * count 必然高于 count0。真正稳定性判据是 soak 期间不变量/故障/溢出未新增，
     * 且心跳与操作计数持续增长、tick 连续。故 leak 仅作信息打印，不参与判定。 */
    int lok = ok
        && ((tk1 - tk0) >= (soak_ms / 1000u))
        && (hb1 > hb0) && ((hb1 - hb0) >= 50u)
        && ((ops1 - ops0) > 500000u)
        && (g_sched_invariant_fail == inv0) && (g_fault_cfsr == flt0)
        && (g_stack_overflow == of0);
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-B1] soak %lums: tick+%lu hb+%lu ops+%lu tcb_delta=%d inv=%lu flt=%lu of=%d %s\n",
               (unsigned long)soak_ms, (unsigned long)(tk1 - tk0), (unsigned long)(hb1 - hb0),
               (unsigned long)(ops1 - ops0), (int)(rtos_task_count() - count0),
               (unsigned long)(g_sched_invariant_fail - inv0), (unsigned long)(g_fault_cfsr - flt0),
               (int)(g_stack_overflow - of0), lok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_B1_Soak", lok);
    /* 清理：回收 soak 任务 TCB 槽 */
    static const char *b1n[6] = { "acc_rt", "acc_sw0", "acc_sw1", "acc_sw2", "acc_sw3", "acc_hb" };
    for (int i = 0; i < 6; i++) {
        task_t *p = (task_t *)rtos_kobj_lookup(b1n[i]);
        if (p) rtos_task_delete(p);
    }
    rtos_msleep(30);
    /* P1-4：TCB 泄漏判定 —— 清理后应无任何 soak 任务残留（kobj_lookup 全部 NULL）。
     * 水位计数(rtos_task_count)单调不减、DEAD 槽复用使其不适合做泄漏判据，故直接
     * 检查命名任务是否已被回收。任一残留即视为泄漏。 */
    int leak = 0;
    for (int i = 0; i < 6; i++) {
        if (rtos_kobj_lookup(b1n[i])) { leak = 1; break; }
    }
    if (leak) {
        ok = 0;
        log_printf(app_log(), LOG_INFO, "rtos",
                   "[ACC-B1] TCB LEAK: soak tasks not reclaimed after cleanup\n");
    }
    g_rtos_deadline_violation = vd0; g_rtos_wcet_violation = vw0; g_rtos_sched_invalid = vs0;
    return ok;
}
/* P1-4：RTOSACCEPT long 专用入口 —— 1 小时长时 soak（验证无 TCB 泄漏 / 无计数漂移）。 */
int acc_b1_soak_long(void) { return acc_b1_soak(ACC_SOAK_LONG_MS); }

/* =================== B2. 资源耗尽 graceful 降级 =================== */
static volatile int g_b2_hb, g_b2_stop, g_b2_ex_stop;
static void b2_hb(void *arg) {
    (void)arg;
    while (!g_b2_stop) { g_b2_hb++; rtos_msleep(5); }
}
/* 耗尽填充任务：检查 ex_stop 后自我了结（变 DEAD，槽自动回收，不影响后续测试） */
static void b2_ex(void *arg) {
    (void)arg;
    while (!g_b2_ex_stop) rtos_msleep(5);
}
int acc_b2_exhaust(void) {
    int ok = 1;
    uint32_t flt0 = g_fault_cfsr, of0 = g_stack_overflow;
    g_b2_ex_stop = 0;
    int made = 0;
    static uint8_t exst[48][256] __attribute__((aligned(8)));
    int i;
    /* 填充任务必须用【低于命令任务】的优先级(>RTOS_PRIO_MAIN=16)，否则 34+ 个
     * 高优先级填充任务会完全饿死运行 RTOSACCEPT 的命令任务(prio 16) -> 套件挂死。
     * 用 prio 28（仅高于 idle），保证命令任务始终能抢占回来。 */
    for (i = 0; i < 48; i++) {
        rtos_task_create("acc_ex", b2_ex, NULL, 28, exst[i], sizeof(exst[i]));
        made++;
        /* 池满时 create 静默拒绝；用 task_count 探测是否已占满 */
        if (rtos_task_count() >= RTOS_MAX_TASKS) {
            made = rtos_task_count();
            break;
        }
    }
    int full = (made >= RTOS_MAX_TASKS) || (rtos_task_count() >= RTOS_MAX_TASKS);
    /* 池满后：删一个已建任务，验证可重建（graceful 降级核心断言） */
    task_t *victim = (task_t *)rtos_kobj_lookup("acc_ex");
    if (victim) rtos_task_delete(victim);
    rtos_msleep(30);
    static uint8_t re_st[256] __attribute__((aligned(8)));
    rtos_task_create("acc_re", b2_ex, NULL, 15, re_st, sizeof(re_st));
    int rebuilt = (rtos_kobj_lookup("acc_re") != NULL);
    int lok1 = full && rebuilt && (g_fault_cfsr == flt0) && (g_stack_overflow == of0);
    if (!lok1) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-B2] tcb-exhaust: made=%d full=%d rebuilt=%d %s\n", made, full, rebuilt, lok1 ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_B2_TCBExhaust", lok1);

