jojo240607/joc-base/src/hal/stm32/test/rtos_accept.c
    /* 回收填充任务：显式逐个删除（避免“自我了结+msleep 等待”在 48 任务并发退出时
     * 偶发挂死）。delete 摘链置 DEAD，槽位立即可被后续测试复用。 */
    int reclaimed = 0;
    for (int k = 0; k < 48; k++) {
        task_t *ex = (task_t *)rtos_kobj_lookup("acc_ex");
        if (!ex) break;
        rtos_task_delete(ex);
        reclaimed++;
    }

    static uint8_t mqb[4 * sizeof(uint32_t)];
    static rtos_mq_t mq;
    rtos_mq_init(&mq, mqb, sizeof(uint32_t), 4);
    int sent = 0;
    /* 非阻塞发送：队列满(trysend 返回 -1)即停止，验证“满后优雅拒绝”（命令任务
     * 绝不能在此阻塞，否则无接收方唤醒 -> 套件永久挂死）。 */
    for (int k = 0; k < 10; k++) { uint32_t v = k; if (rtos_mq_trysend(&mq, &v) == 0) sent++; }
    int lok2 = (sent == 4) && (g_fault_cfsr == flt0);
    if (!lok2) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos", "[ACC-B2] mq-full: accepted=%d (expect 4) %s\n", sent, lok2 ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_B2_MQFull", lok2);

    g_b2_stop = 0; g_b2_hb = 0;
    static uint8_t hb_st[256] __attribute__((aligned(8)));
    rtos_task_create("acc_hb2", b2_hb, NULL, 3, hb_st, sizeof(hb_st));
    uint32_t hb0 = g_b2_hb;
    rtos_msleep(100);
    uint32_t hb1 = g_b2_hb;
    g_b2_stop = 1; rtos_msleep(30);
    int lok3 = (hb1 > hb0);
    if (!lok3) ok = 0;
    RTOS_TEST_RESULT("ACC_B2_AliveUnderExhaust", lok3);
    /* 清理：acc_re / acc_hb2 回收（acc_ex 填充任务已在上方显式删除回收）。 */
    task_t *re = (task_t *)rtos_kobj_lookup("acc_re"); if (re) rtos_task_delete(re);
    task_t *hb2 = (task_t *)rtos_kobj_lookup("acc_hb2"); if (hb2) rtos_task_delete(hb2);
    rtos_msleep(30);
    return ok;
}

/* =================== C1. 真实栈溢出检测 =================== */
/* 与 RTOSROBUST §3.1 / OSTEST TC-CTX-002 同款安全手法：在本命令任务上下文
 * （rtos_running() == 命令任务自身）内 fill 哨兵 -> 故意改写栈底魔数 ->
 * 调 rtos_stack_check_sentinel 验证“检测函数”能报溢出，再还原魔数避免误报。
 *
 * 关键：必须在【命令任务自身】栈上做，而非另起一个满足 MPU 2-幂对齐的独立任务栈——
 * 独立任务栈一旦对齐到大小就会启用 MPU 每任务栈 region 的“最低 1/8 subregion 禁访”
 * 哨兵区，写入栈底魔法数会触发 MemManage；而命令任务栈不满足该对齐要求、退回软件哨兵
 * （无 subregion 禁访），store 成功、det==1 稳定（TC-CTX-002 即此路径，已验证 PASS）。
 *
 * 运行时检测：篡改哨兵后 msleep 触发 PendSV 上下文切换，sched.c 在切换时
 * rtos_stack_check_sentinel(cur) 检出哨兵被踩 -> 置位 g_stack_overflow 粘性标志。 */
int acc_c1_stack_overflow(void) {
    int ok = 1;
    uint32_t of0 = g_stack_overflow;
    task_t *me = rtos_running();
    int fn_det = 0;
    if (me && me->stack_base) {
        rtos_stack_fill_sentinel(me);
        uint32_t *sb = (uint32_t *)me->stack_base;
        uint32_t saved = sb[0];
        sb[0] = 0xDEADBEEFu;                          /* 模拟栈底被踩 */
        fn_det = rtos_stack_check_sentinel(me);       /* 期望返回 1 */
        rtos_msleep(20);                              /* 触发 PendSV 切换，跑内核哨兵检测 */
        sb[0] = saved;                                /* 还原，避免误报 */
    }
    /* 运行时检测：篡改哨兵后发生过上下文切换，内核应已置 g_stack_overflow */
    int runtime = (g_stack_overflow != of0);
    int lok = (fn_det == 1) && runtime;
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-C1] stack-overflow-detect: fn_det=%d rtos_flag=%lu %s\n",
               fn_det, (unsigned long)(g_stack_overflow - of0), lok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_C1_RealStackOverflow", lok);
    g_stack_overflow = of0;           /* 还原全局粘性标志，不污染后续测试 */
    return ok;
}

/* =================== C2. 并发故障（任务 fault 恢复期间 ISR 不丢失） =================== */
/* 验收点：任务在“故意越权恢复窗口”(g_robust_fault_active)内触发除零 UsageFault，
 * 内核恢复后任务存活(survived==1)；与此同时 2kHz TIM5 ISR 持续运行、不丢失、不卡死
 * （验证 fault 恢复路径与中断共存的并发健壮性）。ISR 自身不做越权（避免与任务竞争同一
 * 全局 g_robust_fault_active 标志导致恢复错位），仅做正常计数。 */
static volatile int g_c2_task_survived;
static volatile uint32_t g_c2_isr_cnt;
/* 独立裸函数包裹故障除法（与 RTOSROBUST rb_div0_trigger 同构）：sdiv 后紧跟 bx lr，
 * 故障钩子把异常返回 PC 改为 LR 即“跳过 sdiv / 从本函数返回”，回到 c2_task 继续。
 * 注意：绝不能把 sdiv 直接写在 c2_task 函数体内——那样恢复 PC=LR 会跳过整个 c2_task
 * 剩余代码（含 survived=1），导致任务永远报告未存活。 */
__attribute__((naked))
static void c2_div0_trigger(void) {
    __asm volatile(
        "movs r1, #1\n"
        "sdiv r0, r1, r0\n"   /* r0 = 1/0 -> DIVBYZERO */
        "bx   lr\n"
        ::: "r0", "r1", "memory"
    );
}
static void c2_task(void *arg) {
    (void)arg;
    g_c2_task_survived = 0; g_c2_isr_cnt = 0;
    /* 照搬 RTOSROBUST rb_div0 模式：仅靠 g_robust_fault_active 标志窗口保证只有 C2 的
     * 恢复分支生效，独立裸函数使恢复 PC=LR 正确回到本任务继续。
     *
     * 关键：触发点【绝不能】用 cpsid i 关中断——mpu.c rtos_fault_handler 注释已明确，
     * 关中断会把 UsageFault 升级为 HardFault，栈帧 LR 槽装的是 EXC_RETURN 而非真实
     * 返回地址，恢复会错位（c2_task 因此偶发 fault_delta=0 / survived 错乱）。故此处
     * 不关中断；c2_isr 仅做计数、不触发 fault，窗口内无竞争。 */
    g_robust_fault_active = 1;
    SCB->CCR |= SCB_CCR_DIV_0_TRP_Msk;
    c2_div0_trigger();                         /* 触发 DIVBYZERO；恢复后回到此处 */
    SCB->CCR &= ~SCB_CCR_DIV_0_TRP_Msk;
    g_robust_fault_active = 0;
    g_c2_task_survived = 1;
}
static void c2_isr(void *ctx) {
    (void)ctx;
#ifndef STM32F103xx
    if (TIM5->SR & TIM_SR_UIF) {
        TIM5->SR &= ~TIM_SR_UIF;
        g_c2_isr_cnt++;          /* 正常计数：验证 fault 恢复期间中断不丢失 */
    }
#endif
}
int acc_c2_concurrent_fault(void) {
#ifndef STM32F103xx
    int ok = 1;
    rtos_cycle_init();
    g_c2_task_survived = 0;
    g_robust_fault_cfsr = 0;                  /* 清空 ROBUST 恢复钩子 CFSR 快照 */
    RTOS_TASK_STACK(c2st, 512);
    rtos_task_create("acc_c2t", c2_task, NULL, 10, c2st, sizeof(c2st));
    irq_manager_attach((irq_id_t)TIM5_IRQn, c2_isr, NULL);
    irq_manager_set_priority((irq_id_t)TIM5_IRQn, IRQ_PRIO_KERNEL, IRQ_CLASS_KERNEL);
    irq_manager_enable((irq_id_t)TIM5_IRQn, c2_isr, NULL);
    acc_timer_start(TIM5, 2000);
    rtos_msleep(500);
    acc_timer_stop(TIM5);
    rtos_msleep(50);
    irq_manager_disable((irq_id_t)TIM5_IRQn, c2_isr, NULL);
    irq_manager_detach((irq_id_t)TIM5_IRQn, c2_isr, NULL);
    task_t *c2t = (task_t *)rtos_kobj_lookup("acc_c2t");
    if (c2t) rtos_task_delete(c2t);
    rtos_msleep(30);
    /* 验收核心：
     *  (a) 任务在 fault 恢复窗口内触发 DIVBYZERO 后存活(survived==1)；
     *  (b) ROBUST 恢复钩子捕获到该故障(g_robust_fault_cfsr 含 DIVBYZERO 位 25)——
     *      用专用变量而非差分 g_fault_cfsr（后者是全局粘性标志，易因前置子测试
     *      残留值导致 delta 偶发为 0，使 C2 误判 FAIL）；
     *  (c) 2kHz ISR 在故障恢复期间持续运行不丢失(isr_cnt > 100)；
     *  (d) 不变量/栈溢出未因并发故障而破坏。 */
    uint32_t cfsr_captured = g_robust_fault_cfsr;
    /* 注意：不要求 g_fault_cfsr == flt0——robust 恢复路径（mpu.c rtos_fault_handler）在
     * 恢复后【清除】CFSR 的 DIVBYZERO 位以保证任务干净恢复，故全局 g_fault_cfsr 在 C2 退出
     * 时可能比 flt0 少了该位（这是设计行为，不是回归）。专用变量 g_robust_fault_cfsr 才是
     * C2 触发时真实 CFSR 的快照，用它验证故障捕获即可。 */
    int lok = (g_c2_task_survived == 1)
           && ((cfsr_captured & (1u << 25u)) != 0)   /* DIVBYZERO 在 UFSR 位 9，CFSR 位 25 */
           && (g_c2_isr_cnt > 100)
           && (g_sched_invariant_fail == 0) && (g_stack_overflow == 0);
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-C2] concurrent-fault: task_survived=%d robust_cfsr=0x%lX isr_cnt=%lu inv=%lu%s %s\n",
               g_c2_task_survived, (unsigned long)cfsr_captured,
               (unsigned long)g_c2_isr_cnt,
               (unsigned long)g_sched_invariant_fail,
               #ifdef RTOS_COVERAGE
               " (cov-relaxed)",
               #else
               "",
               #endif
               lok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_C2_ConcurrentFault", lok);
    return ok;
#else
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-C2] concurrent-fault: SKIP (no TIM5 on F103)\n");
    return 1;
#endif
}

/* =================== C3. 长临界区突破硬实时 + 内核有界化捕获（P3 验证） =================== */
/* 验收点（双证据）：
 *  (1) 后台任务持 10ms 临界区（BASEPRI 屏蔽 PendSV）期间，2ms 周期的硬实时任务 c3_rt
 *      无法被调度，其实测唤醒间隔(真实调度延迟)远超其 2ms 绝对 deadline（g_c3_miss > 0）
 *      ——证明长临界区确实突破了硬实时保证（反例观测）。
 *  (2) 内核临界区审计（rtos_crit_enter_mark / rtos_crit_exit_audit，见 sched.c）已检测到
 *      该超长持锁，递增粘性计数 g_rtos_crit_overflow > 0 ——证明 P3「临界区有界化」机制
 *      生效：长临界区不再是不可见的黑洞，而是被内核量化、可被看门狗/诊断读取。
 *
 * C3 不依赖内核 deadline 监视器（其 release_tick 在 tick 唤醒时刷新、屏蔽 PendSV 期间
 * 任务虽被唤醒却不运行，监视器语义上“看不到”该延迟），故用 g_c3_miss 直接观测 +
 * g_rtos_crit_overflow 内核审计双轨验证。 */
static volatile int       g_c3_stop;
static volatile uint32_t  g_c3_miss;
static volatile uint32_t  g_c3_maxgap;
static volatile uint32_t  g_c3_lasthit;
static void c3_rt(void *arg) {
    (void)arg;
    g_c3_lasthit = rtos_tick_count();
    while (!g_c3_stop) {
        uint32_t ent = rtos_tick_count();
        uint32_t gap = (ent > g_c3_lasthit) ? (ent - g_c3_lasthit) : 0;
        if (gap > g_c3_maxgap) g_c3_maxgap = gap;
        g_c3_lasthit = ent;
        if (gap > 2u) g_c3_miss++;          /* 实测唤醒间隔 > 2ms 绝对 deadline = 突破 */
        acc_spin_ms(1);
        rtos_msleep(2);
    }
}
static void c3_bg(void *arg) {
    (void)arg;
    while (!g_c3_stop) {
        unsigned st = rtos_crit_enter();     /* BASEPRI 屏蔽 PendSV */
        acc_spin_ms(10);
        rtos_crit_exit(st);
        rtos_msleep(1);
    }
}
int acc_c3_long_critical(void) {
    int ok = 1;
    rtos_cycle_init();
    uint32_t flt0 = g_fault_cfsr, of0 = g_stack_overflow;   /* 快照：容忍前置子测试遗留 */
    uint32_t crit0 = g_rtos_crit_overflow;                  /* 内核临界区审计计数快照 */
    g_c3_stop = 0; g_c3_miss = 0; g_c3_maxgap = 0;
    static uint8_t c3rt_st[256] __attribute__((aligned(8)));
    rtos_task_attr_t at = { .rt_class = 1, .deadline_ticks = 2, .wcet_ticks = 2 };
    rtos_task_create_rt("acc_c3rt", c3_rt, NULL, 3, c3rt_st, sizeof(c3rt_st), 1, &at);
    static uint8_t c3bg_st[256] __attribute__((aligned(8)));
    rtos_task_create("acc_c3bg", c3_bg, NULL, 20, c3bg_st, sizeof(c3bg_st));
    if (!rtos_kobj_lookup("acc_c3rt")) {
        log_printf(app_log(), LOG_INFO, "rtos", "[ACC-C3] SKIP: pool full\n");
        RTOS_TEST_RESULT("ACC_C3_LongCritical", 0);
        return 1;
    }
    rtos_msleep(1500);
    g_c3_stop = 1; rtos_msleep(50);
    /* 双证据验收：
     *  (a) 长临界区(10ms)突破硬实时(2ms deadline RT 任务) -> g_c3_miss > 0；
     *  (b) 内核临界区审计已捕获超长持锁 -> g_rtos_crit_overflow 相对快照新增 > 0
     *      （P3 有界化机制生效：长临界区不再是不可见黑洞）。
     * 同时系统不变量/溢出/故障不应因临界区而新增（与 C2 遗留的 flt0/of0 比较）。 */
    uint32_t crit_delta = g_rtos_crit_overflow - crit0;
    int lok = (g_c3_miss > 0) && (crit_delta > 0) && (g_sched_invariant_fail == 0)
           && (g_stack_overflow == of0) && (g_fault_cfsr == flt0);
    if (!lok) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-C3] long-critical: miss=%lu maxgap=%lu crit_overflow_delta=%lu "
               "inv=%lu flt_delta=%lu %s\n",
               (unsigned long)g_c3_miss, (unsigned long)g_c3_maxgap,
               (unsigned long)crit_delta,
               (unsigned long)g_sched_invariant_fail,
               (unsigned long)(g_fault_cfsr - flt0), lok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_C3_LongCritical", lok);
    task_t *c3rt = (task_t *)rtos_kobj_lookup("acc_c3rt");
    task_t *c3bg = (task_t *)rtos_kobj_lookup("acc_c3bg");
    if (c3rt) rtos_task_delete(c3rt);
    if (c3bg) rtos_task_delete(c3bg);
    rtos_msleep(30);
    g_rtos_crit_overflow = crit0;   /* 还原快照：不污染后续测试（B2 仍断言 flt0 等） */
    return ok;
}

/* =================== C4. 优先级反转实测（天花板协议开/关对比） =================== */
/* plan P2-2 C4：低优(L)持锁 + 中优(M)争用 + 高优(H)等待。
 * 本 RTOS 优先级约定：数值越小越高（硬实时带 2/3/4 最高，main=RTOS_PRIO_MAIN=16）。
 * 故三任务全部放在 main(16) 之下（数值均 >16），既满足反转链 H>M>L，又绝不会饿死
 * 命令任务（main 高于它们，能在等待循环里推进并清理）；M 忙等也不会卡死 main。
 * 用 rtos_mutex 优先级天花板协议（RTOS_LOCK_CEILING 的同机制等价物：对非 mutex
 * 资源用 RTOS_LOCK_CEILING 宏，对 mutex 用 init(ceil)）做“开/关”对比：
 *   - 天花板=18（高于 M=20）：L 持锁期间 eff 顶到 18，M(20) 无法抢占 L，
 *     H 阻塞 ≈ L 纯持锁时间（反转被消除）。
 *   - 天花板=22（等于 L 自身，不提升）：M(20) 可在 L 持锁期间抢占 L 吃掉 CPU，
 *     H 阻塞被 M 的运行插入放大（典型优先级反转）。
 * 验收（定性，不苛求绝对周期）：
 *   (a) 有天花板时 H 阻塞有界且接近 L 纯持锁（不被 M 显著放大）；
 *   (b) 无天花板时 H 阻塞 > 有天花板时（反转确凿存在）。 */
#define ACC_C4_HOLD_CYC    840000u  /* L 持锁总自旋工作量 ≈5ms @168MHz（> 调度粒度，便于 H 插入） */
#define ACC_C4_MSPIN_CYC   168000u  /* M 自旋 1ms（真正吃 CPU）后睡眠让出，与 L 交替抢 */
#define ACC_C4_PRIO_H     18u       /* 高优等待者：高于 M/L，仍低于 main(16) 之上数值 */
#define ACC_C4_PRIO_M     20u       /* 中优争用者 */
#define ACC_C4_PRIO_L     22u       /* 低优持锁者（全部低于 main，避免饿死命令任务） */
#define ACC_C4_CEIL_ON    18u       /* 天花板生效：高于 M=20，挡住 M 抢占 L */
#define ACC_C4_CEIL_OFF   22u       /* 天花板关闭：等于 L 自身，不提升 */
static volatile int       g_c4_stop;
static volatile int       g_c4_l_locked;
static volatile int       g_c4_l_done;
static volatile int       g_c4_h_done;
static volatile uint32_t  g_c4_h_block;     /* H 阻塞周期（t0=请求锁, t1=拿到锁） */
static rtos_mutex_t       g_c4_mtx;
static rtos_sem_t         g_c4_l_go, g_c4_h_go;
RTOS_TASK_STACK(g_c4_stM, 512); RTOS_TASK_STACK(g_c4_stL, 512); RTOS_TASK_STACK(g_c4_stH, 512);
static void c4_M(void *arg) {                 /* 中优先级：自旋 1ms + 睡眠 1ms 交替，真正抢 L 的 CPU */
    (void)arg;
    while (!g_c4_stop) {
        uint32_t t0 = rtos_cycle_now();
        while ((uint32_t)(rtos_cycle_now() - t0) < ACC_C4_MSPIN_CYC) { }  /* 吃 CPU */
        rtos_msleep(1);                        /* 睡眠让出，L 才能跑；醒来再抢 */
    }
}
static void c4_L(void *arg) {                 /* 低优先级：持锁后连续自旋（需 CPU 的工作） */
    (void)arg;
    rtos_sem_wait(&g_c4_l_go);
    rtos_mutex_lock(&g_c4_mtx);                /* 持锁瞬间 eff 顶到天花板 */
    g_c4_l_locked = 1;
    /* 持锁期间做需 CPU 的工作（连续自旋）。ceil_off 时 M(20) 优先级高于 L eff(22)，
     * 周期性抢走 L 的 CPU（M 自旋 1ms + 睡眠 1ms），拉长 L 完成 5ms 工作量所需的
     * wall-clock（=H 阻塞时长）；ceil_on 时 L eff 顶到 18，M(20) 无法抢，L 独占，
     * wall-clock ≈ 纯工作量。二者差异即优先级反转代价，清晰可观测。 */
    uint32_t t0 = rtos_cycle_now();
    while ((uint32_t)(rtos_cycle_now() - t0) < ACC_C4_HOLD_CYC) { }
    rtos_mutex_unlock(&g_c4_mtx);
    g_c4_l_done = 1;
}
static void c4_H(void *arg) {                 /* 高优先级：在 L 已持锁后请求锁，测阻塞 */
    (void)arg;
    rtos_sem_wait(&g_c4_h_go);
    uint32_t t0 = rtos_cycle_now();
    rtos_mutex_lock(&g_c4_mtx);                /* 阻塞直到 L 释放（天花板交接） */
    uint32_t t1 = rtos_cycle_now();
    g_c4_h_block = (t1 > t0) ? (t1 - t0) : 0;
    rtos_mutex_unlock(&g_c4_mtx);
    g_c4_h_done = 1;
}
/* 跑单场景（天花板 = ceil），返回 H 阻塞周期；TCB 池满则返回 0 并优雅 SKIP。 */
static uint32_t acc_c4_run_scene(uint8_t ceil) {
    rtos_cycle_init();
    rtos_mutex_init(&g_c4_mtx, ceil);
    rtos_sem_init(&g_c4_l_go, 0, 1);
    rtos_sem_init(&g_c4_h_go, 0, 1);
    g_c4_stop = 0; g_c4_l_locked = 0; g_c4_l_done = 0; g_c4_h_done = 0; g_c4_h_block = 0;
    rtos_task_create("acc_c4M", c4_M, NULL, ACC_C4_PRIO_M, g_c4_stM, sizeof(g_c4_stM));
    rtos_task_create("acc_c4L", c4_L, NULL, ACC_C4_PRIO_L, g_c4_stL, sizeof(g_c4_stL));
    rtos_task_create("acc_c4H", c4_H, NULL, ACC_C4_PRIO_H, g_c4_stH, sizeof(g_c4_stH));
    if (!rtos_kobj_lookup("acc_c4H")) {        /* 池满：优雅 SKIP */
        log_printf(app_log(), LOG_INFO, "rtos", "[ACC-C4] SKIP: pool full\n");
        return 0;
    }
    rtos_sem_give(&g_c4_l_go);                  /* L 开始持锁（持锁工作量 5ms ≫ 调度粒度） */
    rtos_msleep(2);                             /* 粗让 L 先持锁并消耗前段工作量 */
    rtos_sem_give(&g_c4_h_go);                  /* L 仍持锁剩余段时，H 才请求锁（测阻塞） */
    uint32_t to = rtos_tick_count() + 200;
    while (!g_c4_h_done && rtos_tick_count() < to) rtos_msleep(1);
    g_c4_stop = 1;
    rtos_msleep(20);
    task_t *p;
    if ((p = (task_t *)rtos_kobj_lookup("acc_c4M"))) rtos_task_delete(p);
    if ((p = (task_t *)rtos_kobj_lookup("acc_c4L"))) rtos_task_delete(p);
    if ((p = (task_t *)rtos_kobj_lookup("acc_c4H"))) rtos_task_delete(p);
    rtos_msleep(30);
    return g_c4_h_block;
}
int acc_c4_prio_inversion(void) {
    int ok = 1;
    uint32_t flt0 = g_fault_cfsr, of0 = g_stack_overflow;
    uint32_t block_on  = acc_c4_run_scene(ACC_C4_CEIL_ON);   /* 天花板生效 */
    uint32_t block_off = acc_c4_run_scene(ACC_C4_CEIL_OFF);  /* 天花板关闭（反转） */
    /* 定性验收：
     *  (a) 有天花板：H 阻塞有界（< L 纯持锁 wall-clock 的 3 倍，证明不被 M 显著放大 —— 反转已消除）；
     *  (b) 无天花板：H 阻塞显著大于有天花板时（> block_on*1.5 且放大量 > 1/4 段 HOLD，
     *      反转确凿：M 在 L 持锁期间插入抢 CPU，拉长 L 完成工作量所需的 wall-clock）。 */
    int inv_cured  = (block_on  > 0) && (block_on  < ACC_C4_HOLD_CYC * 3u);
    int inv_exists = (block_off > 0) && (block_off > block_on * 3u / 2u)
                     && ((int32_t)(block_off - block_on) > (int32_t)(ACC_C4_HOLD_CYC / 4u));
    if (!inv_cured || !inv_exists) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos",
               "[ACC-C4] prio-inversion: hold=%lucyc ceil_on(block_H)=%lucyc(~%luus) "
               "ceil_off(block_H)=%lucyc(~%luus) cured=%d exists=%d %s\n",
               (unsigned long)ACC_C4_HOLD_CYC,
               (unsigned long)block_on,  (unsigned long)(block_on  * 1000000u / 168000000u),
               (unsigned long)block_off, (unsigned long)(block_off * 1000000u / 168000000u),
               inv_cured, inv_exists, ok ? "PASS" : "FAIL");
    RTOS_TEST_RESULT("ACC_C4_PrioInversion", ok);
    /* 不污染后续：本块仅用局部 mutex/sem/任务，无全局违约计数，无需还原快照 */
    (void)flt0; (void)of0;
    return ok;
}

/* =================== 顶层入口 =================== */
int rtos_accept_selftest(void) {
    int ok = 1;
    log_printf(app_log(), LOG_INFO, "rtos", "[ACCEPT] suite begin\n");
    if (acc_a1_periodic()      != 1) ok = 0;
    if (acc_a2_isr_wake()      != 1) ok = 0;
    if (acc_a3_jitter()        != 1) ok = 0;
    if (acc_a4_rta()           != 1) ok = 0;
    if (acc_a5_dyn_sched()     != 1) ok = 0;
    if (acc_a6_ipc_worst()      != 1) ok = 0;
    if (acc_b1_soak(ACC_SOAK_MS) != 1) ok = 0;
    if (acc_b2_exhaust()       != 1) ok = 0;
    if (acc_c1_stack_overflow()!= 1) ok = 0;
    if (acc_c2_concurrent_fault() != 1) ok = 0;
    if (acc_c3_long_critical() != 1) ok = 0;
    if (acc_c4_prio_inversion() != 1) ok = 0;
    log_printf(app_log(), LOG_INFO, "rtos", "[ACCEPT] suite: %s\n", ok ? "PASS" : "FAIL");
    return ok;
}
/* TEMP-DISABLED for boot-crash bisection */ /* RTOS_SELFTEST_ADD("accept", rtos_accept_selftest); */
#endif
